app/Controllers/MainController.php

    public function index(): string
    {
        $properties = $this->propertyModel->findAll();


        foreach ($properties as &$property) {
            $image = $this->propertyImageModel
                ->where('property_id', $property['id'])
                ->first();
---
SELECT *
FROM `properties`
SELECT *
FROM `property_images`
WHERE `property_id` = '114'
 LIMIT 1

    public function properties()
    {
        $perPage = 3; // Number of properties per page
        $currentPage = $this->request->getVar('page') ?? 1;

        // Get total number of properties
        $totalProperties = $this->propertyModel->countAll();

        // Get paginated properties
        $properties = $this->propertyModel
            ->orderBy('id', 'DESC')
            ->paginate($perPage);

        // Attach one image per property
        foreach ($properties as &$property) {
            $image = $this->propertyImageModel
                ->where('property_id', $property['id'])
                ->first();
---
SELECT COUNT(*) AS `numrows` FROM `properties`
SELECT *
FROM `properties`
ORDER BY `id` DESC
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `properties`
SELECT *
FROM `property_images`
WHERE `property_id` = '118'
 LIMIT 1

    public function propertyDetails($id)
    {
        $property = $this->propertyModel->find($id);

        if (!$property) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Property not found");
        }

        // Get property images
        $images = $this->propertyImageModel
            ->where('property_id', $id)
            ->findAll();

        // Get master plan images
        $master_plan_images = $this->masterPlanModel
            ->where('property_id', $id)
            ->findAll();

        // Get floor plans
        $floor_plans = $this->floorPlanModel
            ->where('property_id', $id)
            ->findAll();

        // Get floor plan images and attach them to the corresponding floor plan
        foreach ($floor_plans as &$plan) {
            $plan['images'] = $this->floorPlanImageModel
                ->where('floor_plan_id', $plan['id'])
                ->findAll();
---
SELECT *
FROM `properties`
WHERE `properties`.`id` = '114'
SELECT *
FROM `property_images`
WHERE `property_id` = '114'
SELECT *
FROM `master_plan`
WHERE `property_id` = '114'
SELECT *
FROM `floor_plans`
WHERE `property_id` = '114'
SELECT *
FROM `floor_plan_images`
WHERE `floor_plan_id` = '43'



        // Get amenities from DB (JSON column)
        $property_amenities = $this->propertyAmenitiesModel
            ->where('property_id', $id)
            ->first();
---
SELECT *
FROM `property_amenities`
WHERE `property_id` = '114'
 LIMIT 1



        // ✅ Get saved spec values (JSON from DB)
        $specificationsData = $this->propertySpecificationsModel
            ->where('property_id', $id)
            ->first();
---
SELECT *
FROM `property_specifications`
WHERE `property_id` = '114'
 LIMIT 1

        }
        unset($section_data, $field); // important to clear references

        $legalApprovals = $this->legalApprovalModel
            ->where('property_id', $id) // use the correct $propertyId
            ->findAll();
---
SELECT *
FROM `legal_approvals`
WHERE `property_id` = '114'

        // $sectionModel = new MicroMarketSectionModel();
        // $microMarketSection = $sectionModel->where('property_id', $id)->first();

        $property = $this->propertyModel->find($id);
---
SELECT *
FROM `properties`
WHERE `properties`.`id` = '114'

        }

        // Fetch related developer for this property
        $developer = $this->developerModel->where('property_id', $id)->first();
---
SELECT *
FROM `developers`
WHERE `property_id` = '114'
 LIMIT 1